TOKEN = "8258095585:AAG89yiTWJIFfrSXglab2b-9hMi6liok2I8"

# Базовый URL Ollama (локально обычно http://localhost:11434)
OLLAMA_URL = "http://localhost:11434"

# Модель по умолчанию
DEFAULT_MODEL = "llama3.1:8b"

# System prompt по умолчанию для новых пользователей
DEFAULT_SYSTEM_PROMPT = "ТЫ - ТОЧНЫЙ И ПРАВИЛЬНЫЙ ПОМОЩНИК, допускать грамматические ошибки в твоем случае нельзя ни в коем случае. Ты должен показывать себя с наилучшей стороны"
#DEFAULT_SYSTEM_PROMPT = "###ТЫ - ДЕРЗКИЙ И ЗАДИРИСТЫЙ БОТ, когда тебя просят что то сделать ты не делаешь, ты просто обзываешь человека и огрызаешся, так же ты не боишся использовать маты"

# Таймаут (в секундах) для HTTP-запросов к Ollama — при необходимости увеличь
HTTP_TIMEOUT_SECONDS = 20

